Edragon/WCH/CH55x Demo/CH559 operate CH340.rar/CH559操作CH340/USBH_CH341.C

/********************************** (C) COPYRIGHT *******************************
* File Name          : USBHOST_KM.C
* Author             : WCH
* Version            : V1.2
* Date               : 2015/12/28
* Description        : 
 USB host example for CH559, start USB device under DP/DM port 
USB主机,有关USB-Host的应用例子,初始化和枚举当前Host端口连接的USB设备,有关Root-HUB/外部HUB的应用例子请参考USBH_HUB.C 

不支持U盘
C51   TEST.C 
LX51  TEST.OBJ 
OHX51 TEST 
*******************************************************************************/

#include <CH559.H>
#include <stdio.h>
#include <string.h>

// 各子程序返回状态码
#define	ERR_SUCCESS			  0x00	// 操作成功
#define	ERR_USB_CONNECT		0x15	/* 检测到USB设备连接事件,已经连接 */
#define	ERR_USB_DISCON		0x16	/* 检测到USB设备断开事件,已经断开 */
#define	ERR_USB_BUF_OVER	0x17	/* USB传输的数据有误或者数据太多缓冲区溢出 */
#define	ERR_USB_DISK_ERR	0x1F	/* USB存储器操作失败,在初始化时可能是USB存储器不支持,在读写操作中可能是磁盘损坏或者已经断开 */
#define	ERR_USB_TRANSFER	0x20	/* NAK/STALL等更多错误码在0x20~0x2F */
#define	ERR_USB_UNSUPPORT	0xFB
#define	ERR_USB_UNKNOWN		0xFE

// 获取设备描述符
UINT8C	SetupGetDevDescr[] = { USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_DEVICE, 0x00, 0x00, sizeof( USB_DEV_DESCR ), 0x00 };
// 获取配置描述符
UINT8C	SetupGetCfgDescr[] = { USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_CONFIG, 0x00, 0x00, 0x04, 0x00 };
// 设置USB地址
UINT8C	SetupSetUsbAddr[] = { USB_REQ_TYP_OUT, USB_SET_ADDRESS, USB_DEVICE_ADDR, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 设置USB配置
UINT8C	SetupSetUsbConfig[] = { USB_REQ_TYP_OUT, USB_SET_CONFIGURATION, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
// 清除端点STALL
UINT8C	SetupClrEndpStall[] = { USB_REQ_TYP_OUT | USB_REQ_RECIP_ENDP, USB_CLEAR_FEATURE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

UINT8C	SetupSetBaud1152[] = { 0x40, 0xA1, 0x0c, 0x00, 0x03, 0xCC, 0x00, 0x00 };//115200bps
UINT8C	SetupSetBaud9600[] = { 0x40, 0xA1, 0x0c, 0x00, 0x02, 0x62, 0x00, 0x00 };//9600bps
UINT8C	SetupSetBaud600[] = { 0x40, 0xA1, 0x0c, 0x00, 0x01, 0x64, 0x00, 0x00 };//600bps

UINT8X	UsbDevEndp0Size;	/* USB设备的端点0的最大包尺寸 */

//USB设备相关信息表,CH559最多支持2个设备
#define	ROOT_DEV_DISCONNECT		0
#define	ROOT_DEV_CONNECTED		1
#define	ROOT_DEV_FAILED			2
#define	ROOT_DEV_SUCCESS		3

#ifndef	FOR_ROOT_UDISK_ONLY
#define	DEV_TYPE_KEYBOARD	( USB_DEV_CLASS_HID | 0x20 )
#define	DEV_TYPE_MOUSE		( USB_DEV_CLASS_HID | 0x30 )

struct _RootHubDev{
	UINT8	DeviceStatus;			// 设备状态,0-无设备,1-有设备但尚未初始化,2-有设备但初始化枚举失败,3-有设备且初始化枚举成功
//	UINT8	DeviceAddress;			// 设备被分配的USB地址
	UINT8	DeviceSpeed;			// 0为低速,非0为全速
	UINT8	DeviceType;				// 设备类型
//	union {
//		struct MOUSE {
//			UINT8	MouseInterruptEndp;		// 鼠标中断端点号
//			UINT8	MouseIntEndpTog;		// 鼠标中断端点的同步标志
//			UINT8	MouseIntEndpSize;		// 鼠标中断端点的长度
//		}
//		struct PRINT {
//		}
//	}
//.....    struct  _Endp_Attr   Endp_Attr[4];	//端点的属性,最多支持4个端点
	UINT8	GpVar;					// 通用变量
	UINT8	GpVarIn;					// 通用变量
  UINT8	GpVarOut;					// 通用变量
} xdata ThisUsbDev;

/*
约定: USB设备地址分配规则(参考USB_DEVICE_ADDR)
地址值  设备位置
0x02    内置Root-HUB0下的USB设备或外部HUB
0x03    内置Root-HUB1下的USB设备或外部HUB
0x1x    内置Root-HUB0下的外部HUB的端口x下的USB设备,x为1~n
0x2x    内置Root-HUB1下的外部HUB的端口x下的USB设备,x为1~n
*/

UINT8X	RxBuffer[ MAX_PACKET_SIZE ] _at_ 0x0000 ;  // IN, must even address
UINT8X	TxBuffer[ MAX_PACKET_SIZE ] _at_ 0x0040 ;  // OUT, must even address
#define	pSetupReq	((PXUSB_SETUP_REQ)TxBuffer)
bit		FoundNewDev;

//sbit LED_RUN  = P1^0;
//sbit LED_CFG  = P1^1;
//sbit LED_TMP  = P1^2;

#pragma NOAREGS

void	mDelayuS( UINT16 n );  // 以uS为单位延时

void	mDelaymS( UINT16 n );  // 以mS为单位延时

void	DisableRootHubPort( void );  // 关闭端口,实际上硬件已经自动关闭,此处只是清除一些结构状态

UINT8	AnalyzeRootHub( void );   // 分析端口状态,处理ROOT-HUB端口的设备插拔事件
// 返回ERR_SUCCESS为没有情况,返回ERR_USB_CONNECT为检测到新连接,返回ERR_USB_DISCON为检测到断开

void	SetHostUsbAddr( UINT8 addr );  // 设置USB主机当前操作的USB设备地址

void	SetUsbSpeed( UINT8 FullSpeed );  // 设置当前USB速度

void	ResetRootHubPort( void );  // 检测到设备后,复位总线,为枚举设备准备,设置为默认为全速

UINT8	EnableRootHubPort( void );  // 使能端口,相应的bUH_PORT_EN置1开启端口,设备断开可能导致返回失败

#define	WAIT_USB_TOUT_200US		200  // 等待USB中断超时时间200uS@Fsys=12MHz
UINT8	WaitUSB_Interrupt( void );  // 等待USB中断

// CH559传输事务,输入目的端点地址/PID令牌,同步标志,以20uS为单位的NAK重试总时间(0则不重试,0xFFFF无限重试),返回0成功,超时/出错重试
UINT8	USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout );  // endp_pid: 高4位是token_pid令牌, 低4位是端点地址

UINT8	HostCtrlTransfer( PUINT8X DataBuf, PUINT8I RetLen );  // 执行控制传输,8字节请求码在pSetupReq中,DataBuf为可选的收发缓冲区
// 如果需要接收和发送数据,那么DataBuf需指向有效缓冲区用于存放后续数据,实际成功收发的总长度返回保存在ReqLen指向的字节变量中

void	CopySetupReqPkg( PUINT8C pReqPkt );  // 复制控制传输的请求包

UINT8	CtrlGetDeviceDescr( void );  // 获取设备描述符,返回在TxBuffer中

UINT8	CtrlGetConfigDescr( void );  // 获取配置描述符,返回在TxBuffer中

UINT8	CtrlSetUsbAddress( UINT8 addr );  // 设置USB设备地址

UINT8	CtrlSetUsbConfig( UINT8 cfg );  // 设置USB设备配置

UINT8	CtrlClearEndpStall( UINT8 endp );  // 清除端点STALL

UINT8	AnalyzeHidIntEndp( PUINT8X buf );  // 从描述符中分析出HID中断端点的地址

UINT8	InitRootDevice( void );  // 初始化USB设备

/* 为printf和getkey输入输出初始化串口 */
void	mInitSTDIO( void );

void	InitUSB_Host( void );  // 初始化USB主机

//#define	FREQ_SYS	20000000	// 系统主频20MHz

void	mDelayuS( UINT16 n )  // 以uS为单位延时
{
	while ( n ) {  // total = 12~13 Fsys cycles, 1uS @Fsys=12MHz
		++ SAFE_MOD;  // 2 Fsys cycles, for higher Fsys, add operation here
#ifdef	FREQ_SYS
#if		FREQ_SYS >= 14000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 16000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 18000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 20000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 22000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 24000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 26000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 28000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 30000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 32000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 34000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 36000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 38000000
		++ SAFE_MOD;
#endif
#if		FREQ_SYS >= 40000000
		++ SAFE_MOD;
#endif
#endif
		-- n;
	}
}

void	mDelaymS( UINT16 n )  // 以mS为单位延时
{
	while ( n ) {
		mDelayuS( 1000 );
		-- n;
	}
}

void	DisableRootHubPort( void )  // 关闭端口,实际上硬件已经自动关闭,此处只是清除一些结构状态
{
	ThisUsbDev.DeviceStatus = ROOT_DEV_DISCONNECT;
//	ThisUsbDev.DeviceAddress = 0x00;
	UHUB0_CTRL = 0x00;  // 清除有关HUB0的控制数据,实际上不需要清除
}

UINT8	AnalyzeRootHub( void )   // 分析端口状态,处理端口的设备插拔事件
// 返回ERR_SUCCESS为没有情况,返回ERR_USB_CONNECT为检测到新连接,返回ERR_USB_DISCON为检测到断开
{ //处理端口的插拔事件,如果设备拔出,函数中调用DisableRootHubPort()函数,将端口关闭,插入事件,置相应端口的状态位
	UINT8	s;
	s = ERR_SUCCESS;
	if ( USB_HUB_ST & bUHS_H0_ATTACH ) {  // 设备存在
		if ( ThisUsbDev.DeviceStatus == ROOT_DEV_DISCONNECT  // 检测到有设备插入
			|| ( UHUB0_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 检测到有设备插入,但尚未允许,说明是刚插入
			DisableRootHubPort( );  // 关闭端口
//			ThisUsbDev.DeviceSpeed = USB_HUB_ST & bUHS_DM_LEVEL ? 0 : 1;
			ThisUsbDev.DeviceStatus = ROOT_DEV_CONNECTED;  //置连接标志
			printf( "USB dev in\n" );
			s = ERR_USB_CONNECT;
		}
	}
	else if ( ThisUsbDev.DeviceStatus >= ROOT_DEV_CONNECTED ) {  //检测到设备拔出
		DisableRootHubPort( );  // 关闭端口
		printf( "USB dev out\n" );
		if ( s == ERR_SUCCESS ) s = ERR_USB_DISCON;
	}
//	UIF_DETECT = 0;  // 清中断标志
	return( s );
}

void	SetHostUsbAddr( UINT8 addr )  // 设置USB主机当前操作的USB设备地址
{
	USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | addr & 0x7F;
}

void	SetUsbSpeed( UINT8 FullSpeed )  // 设置当前USB速度
{
	if ( FullSpeed ) {  // 全速
		USB_CTRL &= ~ bUC_LOW_SPEED;  // 全速
		UH_SETUP &= ~ bUH_PRE_PID_EN;  // 禁止PRE PID
	}
	else {
		USB_CTRL |= bUC_LOW_SPEED;  // 低速
	}
}

void	ResetRootHubPort( void )  // 检测到设备后,复位总线,为枚举设备准备,设置为默认为全速
{
	UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;  /* USB设备的端点0的最大包尺寸 */
	SetHostUsbAddr( 0x00 );
	SetUsbSpeed( 1 );  // 默认为全速
	UHUB0_CTRL = UHUB0_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;  // 默认为全速,开始复位
	mDelaymS( 15 );  // 复位时间10mS到20mS
	UHUB0_CTRL = UHUB0_CTRL & ~ bUH_BUS_RESET;  // 结束复位
	mDelayuS( 250 );
	UIF_DETECT = 0;  // 清中断标志
}

UINT8	EnableRootHubPort( void )  // 使能端口,相应的bUH_PORT_EN置1开启端口,设备断开可能导致返回失败
{
	if ( ThisUsbDev.DeviceStatus < ROOT_DEV_CONNECTED ) ThisUsbDev.DeviceStatus = ROOT_DEV_CONNECTED;
	if ( USB_HUB_ST & bUHS_H0_ATTACH ) {  // 有设备
		if ( ( UHUB0_CTRL & bUH_PORT_EN ) == 0x00 ) {  // 尚未使能
			ThisUsbDev.DeviceSpeed = USB_HUB_ST & bUHS_DM_LEVEL ? 0 : 1;
			if ( ThisUsbDev.DeviceSpeed == 0 ) UHUB0_CTRL |= bUH_LOW_SPEED;  // 低速
		}
		UHUB0_CTRL |= bUH_PORT_EN;  //使能HUB端口
		return( ERR_SUCCESS );
	}
	return( ERR_USB_DISCON );
}

UINT8	WaitUSB_Interrupt( void )  // 等待USB中断
{
	UINT16	i;
	for ( i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i -- );
	return( UIF_TRANSFER ? ERR_SUCCESS : ERR_USB_UNKNOWN );
}

// CH559传输事务,输入目的端点地址/PID令牌,同步标志,以20uS为单位的NAK重试总时间(0则不重试,0xFFFF无限重试),返回0成功,超时/出错重试
UINT8	USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout )  // endp_pid: 高4位是token_pid令牌, 低4位是端点地址
{  // 本子程序着重于易理解,而在实际应用中,为了提供运行速度,应该对本子程序代码进行优化
//	UINT8	TransRetry;
#define	TransRetry	UEP0_T_LEN	// 节约内存
	UINT8	s, r;
	UINT16	i;
	UH_RX_CTRL = UH_TX_CTRL = tog;
	TransRetry = 0;
	do {
//		LED_TMP = 0;
		UH_EP_PID = endp_pid;  // 指定令牌PID和目的端点号
		UIF_TRANSFER = 0;  // 允许传输
//		s = WaitUSB_Interrupt( );
		for ( i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i -- );
		UH_EP_PID = 0x00;  // 停止USB传输
//		LED_TMP = 1;
//		if ( s != ERR_SUCCESS ) return( s );  // 中断超时,可能是硬件异常
		if ( UIF_TRANSFER == 0 ) return( ERR_USB_UNKNOWN );
		if ( UIF_DETECT ) {  // USB设备插拔事件
//			mDelayuS( 200 );  // 等待传输完成
			UIF_DETECT = 0;  // 清中断标志
			s = AnalyzeRootHub( );   // 分析ROOT-HUB状态
			if ( s == ERR_USB_CONNECT ) FoundNewDev = 1;
			if ( ThisUsbDev.DeviceStatus == ROOT_DEV_DISCONNECT ) return( ERR_USB_DISCON );  // USB设备断开事件
			if ( ThisUsbDev.DeviceStatus == ROOT_DEV_CONNECTED ) return( ERR_USB_CONNECT );  // USB设备连接事件
//			if ( ( USB_HUB_ST & bUHS_H0_ATTACH ) == 0x00 ) return( ERR_USB_DISCON );  // USB设备断开事件
			mDelayuS( 200 );  // 等待传输完成
		}
		if ( UIF_TRANSFER ) {  // 传输完成
			if ( U_TOG_OK ) return( ERR_SUCCESS );
#ifdef DEBUG_NOW
printf("endp_pid=%02X\n",(UINT16)endp_pid);
printf("USB_INT_FG=%02X\n",(UINT16)USB_INT_FG);
printf("USB_INT_ST=%02X\n",(UINT16)USB_INT_ST);
printf("USB_MIS_ST=%02X\n",(UINT16)USB_MIS_ST);
printf("USB_RX_LEN=%02X\n",(UINT16)USB_RX_LEN);
printf("UH_TX_LEN=%02X\n",(UINT16)UH_TX_LEN);
printf("UH_RX_CTRL=%02X\n",(UINT16)UH_RX_CTRL);
printf("UH_TX_CTRL=%02X\n",(UINT16)UH_TX_CTRL);
printf("UHUB0_CTRL=%02X\n",(UINT16)UHUB0_CTRL);
printf("UHUB1_CTRL=%02X\n",(UINT16)UHUB1_CTRL);
#endif
			r = USB_INT_ST & MASK_UIS_H_RES;  // USB设备应答状态
			if ( r == USB_PID_STALL ) return( r | ERR_USB_TRANSFER );
			if ( r == USB_PID_NAK ) {
				if ( timeout == 0 ) return( r | ERR_USB_TRANSFER );
				if ( timeout < 0xFFFF ) timeout --;
				-- TransRetry;
			}
			else switch ( endp_pid >> 4 ) {
				case USB_PID_SETUP:
				case USB_PID_OUT:
//					if ( U_TOG_OK ) return( ERR_SUCCESS );
//					if ( r == USB_PID_ACK ) return( ERR_SUCCESS );
//					if ( r == USB_PID_STALL || r == USB_PID_NAK ) return( r | ERR_USB_TRANSFER );
					if ( r ) return( r | ERR_USB_TRANSFER );  // 不是超时/出错,意外应答
					break;  // 超时重试
				case USB_PID_IN:
//					if ( U_TOG_OK ) return( ERR_SUCCESS );
//					if ( tog ? r == USB_PID_DATA1 : r == USB_PID_DATA0 ) return( ERR_SUCCESS );
//					if ( r == USB_PID_STALL || r == USB_PID_NAK ) return( r | ERR_USB_TRANSFER );
					if ( r == USB_PID_DATA0 && r == USB_PID_DATA1 ) {  // 不同步则需丢弃后重试
					}  // 不同步重试
					else if ( r ) return( r | ERR_USB_TRANSFER );  // 不是超时/出错,意外应答
					break;  // 超时重试
				default:
					return( ERR_USB_UNKNOWN );  // 不可能的情况
					break;
			}
		}
		else {  // 其它中断,不应该发生的情况
			USB_INT_FG = 0xFF;  /* 清中断标志 */
		}
		mDelayuS( 15 );
	} while ( ++ TransRetry < 3 );
	return( ERR_USB_TRANSFER );  // 应答超时
}

UINT8	HostCtrlTransfer( PUINT8X DataBuf, PUINT8I RetLen )  // 执行控制传输,8字节请求码在pSetupReq中,DataBuf为可选的收发缓冲区
// 如果需要接收和发送数据,那么DataBuf需指向有效缓冲区用于存放后续数据,实际成功收发的总长度保存在ReqLen指向的字节变量中
{
	UINT8	s, RemLen, RxLen, RxCnt, TxCnt;
	PUINT8X	xdata	pBuf;
	PUINT8I	xdata	pLen;
	pBuf = DataBuf;
	pLen = RetLen;
	mDelayuS( 200 );
	if ( pLen ) *pLen = 0;  // 实际成功收发的总长度
	UH_TX_LEN = sizeof( USB_SETUP_REQ );
	s = USBHostTransact( USB_PID_SETUP << 4 | 0x00, 0x00, 200000/20 );  // SETUP阶段,200mS超时
	if ( s != ERR_SUCCESS ) return( s );
	UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_R_AUTO_TOG | bUH_T_TOG | bUH_T_AUTO_TOG;  // 默认DATA1
	UH_TX_LEN = 0x01;  // 默认无数据故状态阶段为IN
	RemLen = pSetupReq -> wLengthH ? 0xFF : pSetupReq -> wLengthL;
	if ( RemLen && pBuf ) {  // 需要收发数据
		if ( pSetupReq -> bRequestType & USB_REQ_TYP_IN ) {  // 收
			while ( RemLen ) {
				mDelayuS( 200 );
				s = USBHostTransact( USB_PID_IN << 4 | 0x00, UH_RX_CTRL, 200000/20 );  // IN数据
				if ( s != ERR_SUCCESS ) return( s );
				RxLen = USB_RX_LEN < RemLen ? USB_RX_LEN : RemLen;
				RemLen -= RxLen;
				if ( pLen ) *pLen += RxLen;  // 实际成功收发的总长度
//				memcpy( pBuf, RxBuffer, RxLen );
//				pBuf += RxLen;
				for ( RxCnt = 0; RxCnt != RxLen; RxCnt ++ ) {
					*pBuf = RxBuffer[ RxCnt ];
					pBuf ++;
				}
				if ( USB_RX_LEN == 0 || ( USB_RX_LEN & ( UsbDevEndp0Size - 1 ) ) ) break;  // 短包
			}
			UH_TX_LEN = 0x00;  // 状态阶段为OUT
		}
		else {  // 发
			while ( RemLen ) {
				mDelayuS( 200 );
				UH_TX_LEN = RemLen >= UsbDevEndp0Size ? UsbDevEndp0Size : RemLen;
//				memcpy( TxBuffer, pBuf, UH_TX_LEN );
//				pBuf += UH_TX_LEN;
				for ( TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt ++ ) {
					TxBuffer[ TxCnt ] = *pBuf;
					pBuf ++;
				}
				s = USBHostTransact( USB_PID_OUT << 4 | 0x00, UH_TX_CTRL, 200000/20 );  // OUT数据
				if ( s != ERR_SUCCESS ) return( s );
				RemLen -= UH_TX_LEN;
				if ( pLen ) *pLen += UH_TX_LEN;  // 实际成功收发的总长度
			}
//			UH_TX_LEN = 0x01;  // 状态阶段为IN
		}
	}
	mDelayuS( 200 );
	s = USBHostTransact( ( UH_TX_LEN ? USB_PID_IN << 4 | 0x00: USB_PID_OUT << 4 | 0x00 ), bUH_R_TOG | bUH_T_TOG, 200000/20 );  // STATUS阶段
	if ( s != ERR_SUCCESS ) return( s );
	if ( UH_TX_LEN == 0 ) return( ERR_SUCCESS );  // 状态OUT
	if ( USB_RX_LEN == 0 ) return( ERR_SUCCESS );  // 状态IN,检查IN状态返回数据长度
	return( ERR_USB_BUF_OVER );  // IN状态阶段错误
}

void	CopySetupReqPkg( PUINT8C pReqPkt )  // 复制控制传输的请求包
{
	UINT8	i;
	for ( i = 0; i != sizeof( USB_SETUP_REQ ); i ++ ) {
		((PUINT8X)pSetupReq)[ i ] = *pReqPkt;
		pReqPkt ++;
	}
}

UINT8	CtrlGetDeviceDescr( void )  // 获取设备描述符,返回在TxBuffer中
{
	UINT8	s;
	UINT8D	len;
	UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;
	CopySetupReqPkg( SetupGetDevDescr );
	s = HostCtrlTransfer( TxBuffer, &len );  // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	UsbDevEndp0Size = ( (PXUSB_DEV_DESCR)TxBuffer ) -> bMaxPacketSize0;  // 端点0最大包长度,这是简化处理,正常应该先获取前8字节后立即更新UsbDevEndp0Size再继续
	if ( len < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL ) return( ERR_USB_BUF_OVER );  // 描述符长度错误
	return( ERR_SUCCESS );
}

UINT8	CtrlGetConfigDescr( void )  // 获取配置描述符,返回在TxBuffer中
{
	UINT8	s;
	UINT8D	len;
	CopySetupReqPkg( SetupGetCfgDescr );
	s = HostCtrlTransfer( TxBuffer, &len );  // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	if ( len < ( (PUSB_SETUP_REQ)SetupGetCfgDescr ) -> wLengthL ) return( ERR_USB_BUF_OVER );  // 返回长度错误
	len = ( (PXUSB_CFG_DESCR)TxBuffer ) -> wTotalLengthL;
	if ( len > MAX_PACKET_SIZE ) return( ERR_USB_BUF_OVER );  // 返回长度错误
	CopySetupReqPkg( SetupGetCfgDescr );
	pSetupReq -> wLengthL = len;  // 完整配置描述符的总长度
	s = HostCtrlTransfer( TxBuffer, &len );  // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	if ( len < ( (PUSB_SETUP_REQ)SetupGetCfgDescr ) -> wLengthL || len < ( (PXUSB_CFG_DESCR)TxBuffer ) -> wTotalLengthL ) return( ERR_USB_BUF_OVER );  // 描述符长度错误
	return( ERR_SUCCESS );
}

UINT8	CtrlSetUsbAddress( UINT8 addr )  // 设置USB设备地址
{
	UINT8	s;
	CopySetupReqPkg( SetupSetUsbAddr );
	pSetupReq -> wValueL = addr;  // USB设备地址
	s = HostCtrlTransfer( NULL, NULL );  // 执行控制传输
	if ( s != ERR_SUCCESS ) return( s );
	SetHostUsbAddr( addr );  // 设置USB主机当前操作的USB设备地址
	mDelaymS( 10 );  // 等待USB设备完成操作
	return( ERR_SUCCESS );
}

UINT8	CtrlSetUsbConfig( UINT8 cfg )  // 设置USB设备配置
{
	CopySetupReqPkg( SetupSetUsbConfig );
	pSetupReq -> wValueL = cfg;  // USB设备配置
	return( HostCtrlTransfer( NULL, NULL ) );  // 执行控制传输
}

UINT8	CtrlClearEndpStall( UINT8 endp )  // 清除端点STALL
{
	CopySetupReqPkg( SetupClrEndpStall );  // 清除端点的错误
	pSetupReq -> wIndexL = endp;  // 端点地址
	return( HostCtrlTransfer( NULL, NULL ) );  /* 执行控制传输 */
}

UINT8	CtrlSetUsbCH341Buad( void )  // 设置341波特率
{
	CopySetupReqPkg( SetupSetBaud1152 );//115200bps
// 	CopySetupReqPkg( SetupSetBaud9600 );//9600bps
// 	CopySetupReqPkg( SetupSetBaud600 );//600
	return( HostCtrlTransfer( NULL, NULL ) );  // 执行控制传输
}

/*返回数据接收长度，数据存放RxBuffer*/
UINT8	RXDUsbCH341BulkIn( void )  // 341批量接收
{
    UINT8 i,s,len,endp = ThisUsbDev.GpVarIn;
		s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );  // CH559传输事务,获取数据,NAK不重试
		if ( s == ERR_SUCCESS ) {
			endp ^= 0x80;  // 同步标志翻转
			ThisUsbDev.GpVarIn = endp;  // 保存同步标志位
			len = USB_RX_LEN;  // 接收到的数据长度
			if ( len ) {
				printf("CH341 In data: \n");
				for ( i = 0; i < len; i ++ ) printf("x%02X ",(UINT16)(RxBuffer[i]) );
				printf("\n");
			}
      return len;
		}
		else if ( s != ( USB_PID_NAK | ERR_USB_TRANSFER ) ) printf("CH341 error %02x\n",(UINT16)s);  // 可能是断开了
    return 0;
}

/*发送数据长度*/
UINT8	TXDUsbCH341BulkOut( PUINT8 pBuf,UINT8 len )  // 341批量发送
{
  UINT8 TxCnt,s,endp;
  endp = ThisUsbDev.GpVarOut;
	while ( len ) {
		mDelayuS( 200 );
		UH_TX_LEN = len >= 32 ? 32 : len;
		for ( TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt ++ ) {
			TxBuffer[ TxCnt ] = *pBuf;
			pBuf ++;
		}
		s = USBHostTransact( USB_PID_OUT << 4 | endp & 0x7F, endp & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );  // OUT数据
		if ( s == ERR_SUCCESS ){ 
		len -= UH_TX_LEN;
		endp ^= 0x80;  // 同步标志翻转
		ThisUsbDev.GpVarOut = endp;  // 保存同步标志位
		}
    else return( s );
	}
  return ERR_SUCCESS;
}

/* ************************************************************************************** */

UINT8	AnalyzeHidIntEndp( PUINT8X buf )  // 从描述符中分析出HID中断端点的地址
{
	UINT8	i, s, l;
	s = 0;
	for ( i = 0; i < ( (PXUSB_CFG_DESCR)buf ) -> wTotalLengthL; i += l ) {  // 搜索中断端点描述符,跳过配置描述符和接口描述符
		if ( ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bDescriptorType == USB_DESCR_TYP_ENDP  // 是端点描述符
			&& ( ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bmAttributes & USB_ENDP_TYPE_MASK ) == USB_ENDP_TYPE_INTER  // 是中断端点
			&& ( ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bEndpointAddress & USB_ENDP_DIR_MASK ) ) {  // 是IN端点
				s = ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bEndpointAddress & USB_ENDP_ADDR_MASK;  // 中断端点的地址
				break;  // 可以根据需要保存wMaxPacketSize和bInterval
		}
		l = ( (PXUSB_ENDP_DESCR)(buf+i) ) -> bLength;  // 当前描述符长度,跳过
		if ( l > 16 ) break;
	}
	return( s );
}

UINT8	InitRootDevice( void )  // 初始化USB设备
{
	UINT8	i, s, cfg, dv_cls, if_cls;
	printf( "Reset host port\n" );
	ResetRootHubPort( );  // 检测到设备后,复位相应端口的USB总线
	for ( i = 0, s = 0; i < 100; i ++ ) {  // 等待USB设备复位后重新连接,100mS超时
		mDelaymS( 1 );
		if ( EnableRootHubPort( ) == ERR_SUCCESS ) {  // 使能端口
			i = 0;
			s ++;  // 计时等待USB设备连接后稳定
			if ( s > 15 ) break;  // 已经稳定连接100mS
		}
	}
	if ( i ) {  // 复位后设备没有连接
		DisableRootHubPort( );
		printf( "Disable host port because of disconnect\n" );
		return( ERR_USB_DISCON );
	}
	SetUsbSpeed( ThisUsbDev.DeviceSpeed );  // 设置当前USB速度
	printf( "GetDevDescr: " );
	s = CtrlGetDeviceDescr( );  // 获取设备描述符
	if ( s == ERR_SUCCESS ) {
		for ( i = 0; i < ( (PUSB_SETUP_REQ)SetupGetDevDescr ) -> wLengthL; i ++ ) printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
		printf( "\n" ); // 显示出描述符
		dv_cls = ( (PXUSB_DEV_DESCR)TxBuffer ) -> bDeviceClass;  // 设备类代码
		s = CtrlSetUsbAddress( ( (PUSB_SETUP_REQ)SetupSetUsbAddr ) -> wValueL );  // 设置USB设备地址
		if ( s == ERR_SUCCESS ) {
//			ThisUsbDev.DeviceAddress = ( (PUSB_SETUP_REQ)SetupSetUsbAddr ) -> wValueL;  // 保存USB地址
			printf( "GetCfgDescr: " );
			s = CtrlGetConfigDescr( );  // 获取配置描述符
			if ( s == ERR_SUCCESS ) {
				cfg = ( (PXUSB_CFG_DESCR)TxBuffer ) -> bConfigurationValue;
				for ( i = 0; i < ( (PXUSB_CFG_DESCR)TxBuffer ) -> wTotalLengthL; i ++ ) printf( "x%02X ", (UINT16)( TxBuffer[i] ) );
				printf("\n");
/* 分析配置描述符,获取端点数据/各端点地址/各端点大小等,更新变量endp_addr和endp_size等 */
				if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceClass;  // 接口类代码
				if ( if_cls == 0xff ) {  // 是CDC类
					// 从描述符中分析出端点的地址,因为固定是341，所以端点已知，不必分析
					ThisUsbDev.GpVar =  1;  // 保存中断端点的地址,位7用于同步标志位,清0
          ThisUsbDev.GpVarIn =  2;
          ThisUsbDev.GpVarOut =  2;
					if_cls = ( (PXUSB_CFG_DESCR_LONG)TxBuffer ) -> itf_descr.bInterfaceProtocol;
					s = CtrlSetUsbConfig( cfg );  // 设置USB设备配置
					if ( s == ERR_SUCCESS ) {
						ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
							SetUsbSpeed( 1 );  // 默认为全速
              s = CtrlSetUsbCH341Buad();
						  if(s != ERR_SUCCESS) return( ERR_USB_UNSUPPORT );            
							return( ERR_SUCCESS );
						}
						else{
							s = ERR_USB_UNSUPPORT;
						}
					}
				else {   // 可以进一步分析
					s = CtrlSetUsbConfig( cfg );  // 设置USB设备配置
					if ( s == ERR_SUCCESS ) {
//						需保存端点信息以便主程序进行USB传输
						ThisUsbDev.DeviceStatus = ROOT_DEV_SUCCESS;
						ThisUsbDev.DeviceStatus = dv_cls ? dv_cls : if_cls;
						SetUsbSpeed( 1 );  // 默认为全速
						return( ERR_SUCCESS );  /* 未知设备初始化成功 */
					}
				}
			}
		}
	}
	printf( "InitRootDev Err = %02X\n", (UINT16)s );
	ThisUsbDev.DeviceStatus = ROOT_DEV_FAILED;
	SetUsbSpeed( 1 );  // 默认为全速
	return( s );
}

/* 为printf和getkey输入输出初始化串口 */
void	mInitSTDIO( void )
{
//	SCON = 0x50;
	SM0 = 0;
	SM1 = 1;
	SM2 = 0;
	REN = 1;
	PCON |= SMOD;
	TMOD = TMOD & ~ bT1_GATE & ~ bT1_CT & ~ MASK_T1_MOD | bT1_M1;  // 0X20
	T2MOD = T2MOD | bTMR_CLK | bT1_CLK;  // *12
	TH1 = 0-13;//0xF3;  /* 12MHz晶振, 4800bps*12=57600bps */
	TR1 = 1;
	TI = 1;
}

void	InitUSB_Host( void )  // 初始化USB主机
{
	IE_USB = 0;
//	LED_CFG = 1;
//	LED_RUN = 0;
	USB_CTRL = bUC_HOST_MODE;  // 先设定模式
	USB_DEV_AD = 0x00;
	UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN ;
	UH_RX_DMA = RxBuffer;
	UH_TX_DMA = TxBuffer;
	UH_RX_CTRL = 0x00;
	UH_TX_CTRL = 0x00;
	USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN;  // 启动USB主机及DMA,在中断标志未清除前自动暂停
//	UHUB0_CTRL = 0x00;
//	UHUB1_CTRL = 0x00;
	UH_SETUP = bUH_SOF_EN;
	USB_INT_FG = 0xFF;  // 清中断标志
	DisableRootHubPort( );  // 清空
	USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
//	IE_USB = 1;  // 查询方式
}

main( ) {
	UINT8	i, s,endp,len;
  UINT8 tmpBuf[4] = {'a','d','t','X'};
//	SAFE_MOD = 0x55;
//	SAFE_MOD = 0xAA;
//	CLOCK_CFG |= bOSC_EN_XT;
// CLOCK_CFG &= ~bOSC_EN_INT;
	mInitSTDIO( );  /* 为了让计算机通过串口监控演示过程 */
	printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
	InitUSB_Host( );
	FoundNewDev = 0;
	printf( "Wait Device In\n" );
	while ( 1 ) {
		s = ERR_SUCCESS;
		if ( UIF_DETECT ) {  // 如果有USB主机检测中断则处理
			UIF_DETECT = 0;  // 清中断标志
			s = AnalyzeRootHub( );   // 分析ROOT-HUB状态
			if ( s == ERR_USB_CONNECT ) FoundNewDev = 1;
		}
//		if ( s == ERR_USB_CONNECT ) {
//		}
		if ( FoundNewDev || s == ERR_USB_CONNECT ) {  // 有新的USB设备插入
			FoundNewDev = 0;
			mDelaymS( 200 );  // 由于USB设备刚插入尚未稳定,故等待USB设备数百毫秒,消除插拔抖动
			s = InitRootDevice( );  // 初始化USB设备
			if ( s != ERR_SUCCESS ) return( s );
		}
//		other work for each device
		mDelaymS( 100 );  // 模拟单片机做其它事
    if(ThisUsbDev.DeviceStatus == ROOT_DEV_SUCCESS)
    {
      TXDUsbCH341BulkOut( tmpBuf,4 );
	    RXDUsbCH341BulkIn(  );  // 341批量接收
    }
	}
}

